Repository: Leuchtfeuer/auth0-for-typo3
Catalog: Resources/Private/Language/*.Database.xlf
Languages: de

# tx_auth0_domain_model_frontenduser.auth0_user_id
source: Auth0 User ID
de: Auth0 Nutzer ID

# tx_auth0_domain_model_frontenduser.auth0_metadata
source: Auth0 Metadata
de: Auth0 Metadaten

# tx_auth0_domain_model_frontenduser.auth0_last_application
source: Last used Auth0 application
de: Zuletzt genutzte Auth0 Applikation

# tx_auth0_domain_model_frontenduser
source: Auth0 Website User
de: Auth0 Webseiten-Nutzer

# tx_auth0_domain_model_frontendusergroup.auth0_user_group
source: Auth0 User Group
de: Auth0 Benutzergruppe

# tx_auth0_domain_model_application
source: Application
de: Applikation

# tx_auth0_domain_model_application.api
source: Use API
de: API Nutzung

# tx_auth0_domain_model_application.signature_algorithm
source: JWT Signature Algorithm
de: JWT Signatur Algorithmus

# tabs.basic
source: Basic
de: Basis

# palettes.client
source: Client Configuration
de: Client Konfiguration

# fe_users.tx_extbase_type.Tx_Auth0_FrontendUser
source: Auth0 Website User
de: Auth0 Webseiten-Nutzer

# fe_groups.tx_extbase_type.Tx_Auth0_FrontendUserGroup
source: Auth0 User Group
de: Auth0 Benutzergruppe

# tt_content.pi_flexform.sheet_general
source: General
de: Generell

# tt_content.pi_flexform.softLogout
source: Logout from TYPO3 only (not from Auth0)
de: Nur vom TYPO3 abmelden (nicht von Auth0)

# tt_content.pi_flexform.referrerAnchor
source: Anchor for the referrer/callback url
de: Anker für die Referrer/Callback url

# tt_content.pi_flexform.sheet_redirect
source: Redirects
de: Weiterleitungen

# tt_content.pi_flexform.redirectMode
source: Redirect Mode
de: Modus

# tt_content.pi_flexform.redirectMode.I.0
source: Defined by Usergroup Record
de: Wie in der Benutzergruppe definiert

# tt_content.pi_flexform.redirectMode.I.1
source: Defined by User Record
de: Wie im Benutzer definiert

# tt_content.pi_flexform.redirectMode.I.2
source: After Login (TS or Flexform)
de: Nach der Anmeldung (TS oder Flexform)

# tt_content.pi_flexform.redirectMode.I.3
source: After Logout (TS or Flexform)
de: Nach der Abmeldung (TS oder Flexform)

# tt_content.pi_flexform.redirectMode.I.4
source: After Login Error (TS or Flexform)
de: Nach fehlerhafter Anmeldung (TS oder Flexform)

# tt_content.pi_flexform.redirectMode.I.5
source: Defined by GET/POST Parameters
de: Definiert durch GET/POST Parameter

# tt_content.pi_flexform.redirectMode.I.6
source: Defined by Referrer
de: Definiert durch den Referrer

# tt_content.pi_flexform.redirectFirstMethod
source: Use First Supported Mode from Selection
de: Ersten ausgewählten Modus, der zutrifft, verwenden

# tt_content.pi_flexform.redirectPageLogin
source: After Successful Login Redirect to Page
de: Nach erfolgreicher Anmeldung: Weiterleitung auf Seite

# tt_content.pi_flexform.redirectPageLoginError
source: After Failed Login Redirect to Page
de: Nach fehlgeschlagener Anmeldung: Weiterleitung auf Seite

# tt_content.pi_flexform.redirectPageLogout
source: After Logout Redirect to Page
de: Nach Abmeldung: Weiterleitung auf Seite

# tt_content.pi_flexform.redirectDisable
source: Disable Redirect
de: Weiterleitung deaktivieren

# backend.page.view.additionalAuthorizeParameters
source: Authorize Parameters
de: Zusätzliche authorisierungs Parameter

# fe_groups.auth0_user_group
source: Auth0 Role Identifier
de: Auth0 Rolle
