Repository: Leuchtfeuer/auth0-for-typo3
Catalog: Resources/Private/Language/*.locallang_mod.xlf
Languages: de

# mlang_labels_tabdescr
source: A mapping for Auth0 roles to TYPO3 frontend user groups.
de: Ein Mapping von Auth0 Rollen zu TYPO3 Benutzergruppen.

# mlang_labels_tablabel
source: Auth0 role data mapping.
de: Auth0 Rollen Mapping.

# roles.title
source: Role Mapping
de: Auth0 Rollen Mapping

# roles.frontend.text
source: This website usergroup is assigned to an user if none of his Auth0 roles is assigned to a website usergroup.
de: Diese Webseiten Benutzergruppe wird einem Nutzer zugewiesen, wenn keine der hinterlegten Mapping Konfigurationen zutrifft oder der Nutzer keine Auth0 Rolle hinterlegt hat.

# roles.frontend.label
source: Default Website Usergroup
de: Standard Webseiten-Nutzergruppe

# roles.frontend.default
source: No default group
de: Keine Standardgruppe

# roles.frontend.no_groups
source: No website usergroup found.
de: Keine Webseiten-Nutzergruppe gefunden.

# roles.backend.text
source: This backend user group is assigned to an user if none of his Auth0 roles is assigned to a backend user group.
de: Diese Backend Benutzergruppe wird einem Nutzer zugewiesen, wenn keine der hinterlegten Mapping Konfigurationen zutrifft oder der Nutzer keine Auth0 Rolle hinterlegt hat.

# roles.backend.label
source: Default Backend Usergroup
de: Standardgruppe Backend

# roles.backend.default
source: No default group
de: Keine Standardgruppe

# roles.backend.no_groups
source: No backend usergroup found.
de: Keine Backend Benutzergruppe gefunden.

# roles.admin.text
source: If a user has this Auth0 role, he becomes a TYPO3 backend administrator.
de: Wenn ein Auth0 Benutzer über diese Rolle verfügt, wird er zum TYPO3 Backend Administrator.

# roles.admin.label
source: Backend-Admin Role
de: Rolle des Backend Administrators

# roles.key.text
source: The key (below the Auth0 application metadata) that contains the roles. The recommended default is "roles".
de: Der Schlüssel (unterhalb der Auth0 Applikations-Metadaten), der die Rollen beinhaltet.

# roles.key.label
source: Auth0 Key
de: Auth0 Schlüssel

# roles.button
source: Save configuration
de: Konfiguration speichern

# roles.table.head.identifier
source: Identifier
de: ID

# roles.table.head.title
source: Title
de: Titel

# roles.table.head.role
source: Auth0 Role
de: Auth0 Rolle

# roles.table.head.subgroups
source: Subgroups
de: Untergruppen

# application.title
source: Applications
de: Applikationen

# application.text
source: Newly created applications are stored here:
de: Neu erstellte Applikationen werden hier gespeichert:

# application.no_directory
source: No storage location for new applications could be found. Please adjust the TypoScript constant <code>module.tx_auth0.persistence.storagePid</code> or configure a valid location for website users in the extension configuration.
de: Es konnte kein Speicherort für neue Anwendungen gefunden werden. Bitte passen Sie die TypoScript-Konstante <code>module.tx_auth0.persistence.storagePid</code> an oder konfigurieren Sie einen gültigen Speicherort für Website-Benutzer in der Erweiterungskonfiguration.

# application.new
source: Create new Application
de: Neue Applikation erstellen

# application.infobox.title
source: No Application Found
de: Keine Applikation gefunden

# application.infobox.content
source: Start now and create your first Auth0 application.
de: Starte jetzt und erstelle deine erste Auth0 Applikation.

# application.ts.title
source: TypoScript included?
de: TypoScript eingebunden?

# application.ts.content
source: No TypoScript configuration found.
de: Keine TypoScript Konfiguration gefunden.

# application.ts.button
source: Go to template module
de: Zum Template Modul

# list.card.mapping.title
source: Roles To Groups
de: Rollen zu Benutzergruppen

# list.card.mapping.subtitle
source: User Groups
de: Benutzergruppen

# list.card.mapping.text
source: Configure the mapping of Auth0 roles to TYPO3 user groups.
de: Konfiguriere, welche Auth0 Rollen welchen TYPO3 Benutzergruppen (Frontend und Backend) entsprechen.

# list.card.metadata.title
source: Property Mapping
de: Benutzereigenschaften

# list.card.metadata.subtitle
source: Users
de: Benutzer

# list.card.metadata.text
source: Configure the mapping of Auth0 data (and metadata) to TYPO3 user properties.
de: Konfiguriere, welche Auth0 Daten (und Metadata) welchen Eigenschaften eines TYPO3 Benutzers entsprechen.

# list.card.application.title
source: Auth0 Application List
de: Listenansicht von Applikationen

# list.card.application.subtitle
source: Database
de: Datenbank

# list.card.application.text
source: Show, add and configure Auth0 applications used by your TYPO3 instance.
de: Anzeigen, hinzufügen und bearbeiten von Auth0 Applikationen, die von deinem TYPO3 System genutzt werden.

# list.card.button
source: Configure
de: Konfigurieren

# list.card.documentation.title
source: Want to Read More?
de: Hast du noch Frage?

# list.card.documentation.subtitle
source: Documentation
de: Dokumentation

# list.card.documentation.text
source: A detailed documentation of this extension can be found on the TYPO3 documentation server.
de: Eine ausführliche Dokumentation dieser Extension findest du auf dem TYPO3 Dokumentations-Server.

# list.card.documentation.button
source: Read more
de: Zur Dokumentation

# list.card.issue.title
source: Found an Issue?
de: Fehler gefunden?

# list.card.issue.subtitle
source: Source Code
de: Quellcode

# list.card.issue.text
source: If you have found a bug or are missing a feature, you can take a look at our repository.
de: Du hast einen Fehler gefunden oder vermisst ein Feature? Wirf doch mal einen Blick ins Repository.

# list.card.issue.button
source: Find out more
de: Zum Repository

# properties.title
source: Property Mapping
de: Eigenschaften Mapping

# properties.title.root
source: Root Data
de: Hauptdaten

# properties.title.user
source: User Metadata
de: Benutzer Metadaten

# properties.title.app
source: Application Metadata
de: Applikations Metadaten

# properties.title.edit
source: Edit Property
de: Eigenschaft bearbeiten

# properties.title.add
source: Add Property
de: Eigenschaft hinzufügen

# properties.new
source: Create new
de: Neu erstellen

# properties.no-configuration
source: No configuration found.
de: Keine Konfiguration gefunden.

# properties.table.auth0
source: Auth0 Property
de: Auth0 Eigenschaft

# properties.table.typo3
source: TYPO3 Property
de: TYPO3 Eigenschaft

# properties.table.processing
source: Value Processing
de: Prozessierung

# properties.button.save
source: Save
de: Speichern

# properties.infobox.api.title
source: Availability of Auth0 User Data
de: Verfügbarkeit von Auth0-Benutzerdaten

# properties.infobox.api.content
source: Please note that not all data (especially the user and app meta data) may be available if your application has disabled the use of the API.
de: Bitte beachte, dass möglicherweise nicht alle Benutzerdaten (insbesondere die User und App Metadaten) verfügbar sind, wenn die Anwendung die Verwendung der API deaktiviert hat.

# message.application.deleted.title
source: Application Removed!
de: Applikation gelöscht!

# message.application.deleted.text
source: The application has been removed successfully.
de: Die Auth0 Applikation wurde entfernt.

# message.property.created.title
source: Configuration Created!
de: Konfiguration erstellt!

# message.property.created.text
source: The configuration has been created successfully.
de: Die Konfiguration wurde erfolgreich erstellt.

# message.property.deleted.title
source: Configuration Removed!
de: Konfiguration gelöscht!

# message.property.deleted.text
source: The configuration has been removed successfully.
de: Die Konfiguration wurde erfolgreich gelöscht.

# message.property.updated.title
source: Configuration Updated!
de: Konfiguration aktualisiert!

# message.property.updated.text
source: The configuration has been updated successfully.
de: Die Konfiguration wurde erfolgreich aktualisiert.

# message.property.imported.title
source: TypoScript Imported!
de: TypoScript Einstellungen importiert!

# message.property.imported.text
source: The TypoScript has been imported successfully. You can now remove your TypoScript settings.
de: Die TypoScript Einstellungen wurden geladen und übertragen. Du kannst das TypoScript jetzt entfernen.

# message.role.updated.title
source: Configuration Updated!
de: Konfiguration aktualisiert!

# message.role.updated.text
source: The configuration has been updated successfully.
de: Die Konfiguration wurde erfolgreich aktualisiert.

# message.role.imported.title
source: TypoScript Imported!
de: TypoScript Einstellungen importiert!

# message.role.imported.text
source: The TypoScript has been imported successfully. You can now remove your TypoScript settings.
de: Die TypoScript Einstellungen wurden geladen und übertragen. Du kannst das TypoScript jetzt entfernen.

# menu.label.applications
source: Application List
de: Applikationen

# menu.label.roles
source: Role Mapping
de: Benutzergruppen

# menu.label.properties
source: Property Mapping
de: Benutzereigenschaften

# menu.button.overview
source: Back to overview
de: Zurück zur Übersicht

# menu.button.cancel
source: Back to list view
de: Zurück zur Listenansicht
