Repository: Leuchtfeuer/auth0-for-typo3
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# plugin.loginForm.title
source: Login form
de: An- / Abmeldeformular

# plugin.loginForm.description
source: Login form for Auth0 and TYPO3
de: An- und Abmeldeformular für Auth0 und TYPO3

# form.login.typo3
source: Log in to TYPO3
de: Am TYPO3 anmelden

# form.login.copyright
source: More about Auth0
de: Mehr über Auth0

# form.login.copyright.description
source: Auth0 is the solution you need for web, mobile, IoT, and internal applications. Loved by developers and trusted by enterprises.
de: Auth0 ist die Lösung, die Sie für Web-, Mobil-, IoT- und interne Anwendungen benötigen. Von Entwicklern geliebt und von Unternehmen vertraut.

# form.logout.auth0
source: Log out from Auth0
de: Vom Auth0 abmelden

# form.login.auth0
source: Log in to Auth0
de: In Auth0 einloggen

# form.logged-in-as
source: Hello
de: Hallo

# form.not-logged-in
source: You are currently <strong>not</strong> logged in to Auth0.
de: Du bist derzeit <strong>nicht</strong> in Auth0 angemeldet.

# form.error.no_application.title
source: No Application
de: Keine Applikation ausgewählt

# form.error.no_application.description
source: Please choose an application, which should be used for log in to TYPO3.
de: Bitte wähle einen Applikations-Datensatz aus, mit dem du dich am TYPO3 anmelden möchtest.

# form.error.no_typoscript.title
source: No TypoScript
de: Kein TypoScript gefunden

# form.error.no_typoscript.description
source: No settings for TYPO3 backend found. TypoScript included?
de: Keine Konfiguration für das TYPO3 Backend gefunden. Hast du das TypoScript eingebunden?

# form.logged-in.success.title
source: Well done!
de: Hervorragend!

# form.logged-in.success.description
source: You have successfully logged in.
de: Du hast dich erfolgreich angemeldet.
