Repository: Leuchtfeuer/auth0-for-typo3
Catalog: Resources/Private/Language/*.locallang_em.xlf
Languages: de

# backend.enable_backend_login
source: Backend Log In: Enable Auth0 login for TYPO3 backend
de: Backend Anmeldung: Aktiviere den Auth0 Login für dein TYPO3 Backend

# backend.backend_connection
source: Application: Application identifier for backend login
de: Applikation: ID der Applikation, die für den Backend Login genutzt werden soll

# backend.reactivate_disabled_backend_users
source: Reactivate Disabled Users: Allow log in for disabled backend users
de: Deaktivierte Benutzter reaktivieren: Erlaube es deaktivierten Backend-Benutzern, sich anzumelden

# backend.reactivate_deleted_backend_users
source: Reactivate Deleted Users: Allow log in for deleted backend users
de: Gelöschte Benutzter reaktivieren: Erlaube es gelöschten Backend-Benutzern, sich anzumelden

# backend.soft_logout
source: Soft Log Out: Logout from TYPO3 only (not from Auth0)
de: Soft Log Out: Nur vom TYPO3 Backend abmelden (nicht vom Auth0)

# backend.additional_authorize_parameters
source: Additional Query Parameters: Additional query parameters for backend authentication (e.g. "access_type=offline&connection=google-oauth2")
de: Zusätzliche Query Parameter: Zusätzliche query Parameter für die Backend-Authentifizierung (z.B.: "access_type=offline&connection=google-oauth2")

# frontend.enable_frontend_login
source: Frontend Log In: Enable Auth0 log in for TYPO3 frontend
de: Webseiten Login: Aktiviere Auth0 zur Anmeldung auf deiner Webseite

# frontend.user_storage_page
source: Storage Page: Storage page for frontend user
de: Systemordner: Ordner, in dem die Webseitenbenutzer abgelegt werden sollen

# frontend.reactivate_disabled_frontend_users
source: Reactivate Disabled Users: Allow log in for disabled frontend users
de: Deaktivierte Benutzter reaktivieren: Erlaube es deaktivierten Benutzern, sich anzumelden

# frontend.reactivate_deleted_frontend_users
source: Reactivate Deleted Users: Allow log in for deleted frontend users
de: Gelöschte Benutzter reaktivieren: Erlaube es gelöschten Benutzern, sich anzumelden

# token.private_key_file
source: Private Key File: The absolute path to your private key file on your server. If set, this key will be used for signing the generated tokens. Otherwise, TYPO3's encryption key will be used. Only RSA keys are supported for now.
de: Pfad zum privaten Schlüssel: Der absolute Dateipfad zum privaten Schlüssel auf deinem Server. Wenn du hier einen Pfad angibst, wird der Schlüssel genutzt, um die generierten Token zu signieren; anderenfalls wird der vom TYPO3 bereitgestellte encryption key genutzt. Derzeit werden lediglich RSA Schlüssel akzeptiert.

# token.public_key_file
source: Public Key File: The absolute path to your public key file on your server.
de: Pfad zum öffentlichen Schlüssel: Der absolute Dateipfad zum öffentlichen Schlüssel auf deinem Server.

# token.user_identifier
source: User Identifier: The property of the ID token containing the unique user ID (default: "sub").
de: User Identifier: Die Eigenschaft des ID Tokens, die die eindeutige Benutzer-ID enthält (Standard: "sub").
